Обработки/Reports/_СправкаОРазмереАктивовСПеречнемВключенныхВРасчетВидовАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СправкаОРазмереАктивовСПеречнемВключенныхВРасчетВидовАктивов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДоговоровДоверительногоУправления</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокОтчетныхДат</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПоДоговору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпискиДоговоров</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСпискаДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНеУдовлетворяющиеТребованиямАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПоАктиву</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СправкаОРазмереАктивовСПеречнемВключенныхВРасчетВидовАктивов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Отчет.СписокОтчетныхДат.ТипЗначения = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ЗаполнитьВидыДоговоровДоверительногоУправления();	
	
	// Добавим возможность менять организацию для полных прав 
	
	Элементы.Организация.Видимость			= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.ОрганизацияНадпись.Видимость	= Не Элементы.Организация.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	ЗаполнитьВидыДоговоровДоверительногоУправления();	
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)

	РаботаСОтчетами.ЗапомнитьКлючВариантаОтчета(Отчет, ЭтаФорма.КлючТекущегоВарианта);
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(Отчет);		
	
	Если ВариантОтчета = "КонкурсПФР" Тогда
		Отчет.ДетализацияПоДоговору = Истина;		
	Иначе
		Отчет.ДетализацияПоАктиву						   = Ложь;		
		Отчет.ОтображатьНеУдовлетворяющиеТребованиямАктивы = Ложь;		
	КонецЕсли;
	
	НастройкаВидимостиИДоступности(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокВыбораПредставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры
	
#КонецОбласти

#Область События_реквизитов_формы

&НаКлиенте
Процедура СписокОтчетныхДатПриИзменении(Элемент)
	
	НарушениеСортировки = Ложь;
	ПредыдущаяДата = Дата(1,1,1);
	
	Для Каждого Элемент Из Отчет.СписокОтчетныхДат Цикл
		Если ПредыдущаяДата > Элемент.Значение Тогда
			НарушениеСортировки = Истина;
		КонецЕсли;
		ПредыдущаяДата = Элемент.Значение;
	КонецЦикла;
	
	Если НарушениеСортировки Тогда
		Если Вопрос("Сортировать список отчётных дат по возрастанию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Отчет.СписокОтчетныхДат.СортироватьПоЗначению();
		КонецЕсли;
	КонецЕсли;
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоДоговоруПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНеУдовлетворяющиеТребованиямАктивыПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоАктивуПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоДоговорамПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторСпискаДоговоровПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВидыДоговоровДоверительногоУправленияПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	
	Элементы.КомандаПоказатьНастройки.Пометка = НЕ Элементы.КомандаПоказатьНастройки.Пометка;
	
	НастройкаВидимостиИДоступности(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровДобавить(Команда)
	
	ПараметрыОткрытия = Новый Структура("ПредставлениеСписка,СписокДоговоров", "", Новый СписокЗначений);
	
	ПараметрыВыбора = ОткрытьФормуМодально("ВнешнийОтчет._СправкаОРазмереАктивовСПеречнемВключенныхВРасчетВидовАктивов.Форма.РедактированиеСпискаДоговоров", ПараметрыОткрытия, ЭтаФорма);
	
	Если ПараметрыВыбора <> Неопределено Тогда
		
		ДобавленныйЭлемент = Отчет.СпискиДоговоров.Добавить(ПараметрыВыбора.СписокДоговоров, ПараметрыВыбора.ПредставлениеСписка); 
		
		ОбновитьСписокВыбораПредставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
	
		Отчет.ИдентификаторСпискаДоговоров = ДобавленныйЭлемент.ПолучитьИдентификатор();
		
		ПриИзмененииПараметровОтчета(ЭтаФорма);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровРедактировать(Команда)
	
	НайденныйЭлемент = Отчет.СпискиДоговоров.НайтиПоИдентификатору(Отчет.ИдентификаторСпискаДоговоров);
	
	Если НайденныйЭлемент <> Неопределено Тогда
	
		ПараметрыОткрытия = Новый Структура("ПредставлениеСписка,СписокДоговоров", НайденныйЭлемент.Представление, НайденныйЭлемент.Значение);
		
		ПараметрыВыбора = ОткрытьФормуМодально("ВнешнийОтчет._СправкаОРазмереАктивовСПеречнемВключенныхВРасчетВидовАктивов.Форма.РедактированиеСпискаДоговоров", ПараметрыОткрытия, ЭтаФорма);
		
		Если ПараметрыВыбора <> Неопределено Тогда
			
			НайденныйЭлемент.Значение		= ПараметрыВыбора.СписокДоговоров;
			НайденныйЭлемент.Представление	= ПараметрыВыбора.ПредставлениеСписка;
			
			ОбновитьСписокВыбораПредставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
			
			ПриИзмененииПараметровОтчета(ЭтаФорма);

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоговоровУдалить(Команда)
	
	ВыбранныйЭлемент = Отчет.СпискиДоговоров.ВыбратьЭлемент("Удалить список договоров", Отчет.СпискиДоговоров.НайтиПоИдентификатору(Отчет.ИдентификаторСпискаДоговоров));
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		Отчет.СпискиДоговоров.Удалить(ВыбранныйЭлемент);
		
		ОбновитьСписокВыбораПредставленияСпискаДоговоров(Элементы.ИдентификаторСпискаДоговоров.СписокВыбора, Отчет.СпискиДоговоров);
		
		ПриИзмененииПараметровОтчета(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьУровеньГруппировки(Команда)

	Результат.ПоказатьУровеньГруппировокСтрок(Число(Сред(Команда.Имя, СтрДлина("УстановитьУровеньГруппировки") + 1)) - 1);	
	
КонецПроцедуры

#КонецОбласти

#Область Дополнительные_процедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастройкаВидимостиИДоступности(Форма)
	
	Элементы		= Форма.Элементы;
	Отчет			= Форма.Отчет;
	ВариантОтчета	= РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(Отчет);	
	
	Элементы.ГруппаНастройки.Видимость								= Элементы.КомандаПоказатьНастройки.Пометка;
	Элементы.ГруппаСписокДоговоров.Видимость						= Отчет.ОтборПоДоговорам;
	Элементы.ВидыДоговоровДоверительногоУправления.Видимость		= Не Отчет.ОтборПоДоговорам;
	Элементы.ДетализацияПоДоговору.Видимость						= (ВариантОтчета <> "КонкурсПФР");
	Элементы.ДетализацияПоАктиву.Видимость							= (ВариантОтчета = "КонкурсПФР");
	Элементы.ОтображатьНеУдовлетворяющиеТребованиямАктивы.Видимость	= (ВариантОтчета = "КонкурсПФР");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписокВыбораПредставленияСпискаДоговоров(СписокВыбора, СпискиДоговоров)
	
	СписокВыбора.Очистить();
	
	Для Каждого ЭлементСпискаДоговоров Из СпискиДоговоров Цикл
		СписокВыбора.Добавить(ЭлементСпискаДоговоров.ПолучитьИдентификатор(), ЭлементСпискаДоговоров.Представление); 
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыДоговоровДоверительногоУправления()
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ВидыДоговоровДоверительногоУправления Цикл 
		Если Отчет.ВидыДоговоровДоверительногоУправления.НайтиПоЗначению(ЗначениеПеречисления) = Неопределено Тогда
			Отчет.ВидыДоговоровДоверительногоУправления.Добавить(ЗначениеПеречисления, , Истина);
		КонецЕсли;
	КонецЦикла;	
	
	Отчет.ВидыДоговоровДоверительногоУправления.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииПараметровОтчета(ЭтаФорма)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

#КонецОбласти
